{
  "prefix": "[ZeroMod] ",
  "options": {
    "debug": false,
    "mods": {
      "filter": true,
      "antiSpam": true,
      "antiLink": true,
      "antiSpamCommands": true
    },
    "thresholdFilter": 0.5,
    "typeFilter": "TOXICITY",
    "timeoutSpam": 1000,
    "commandTimeoutSpam": 500,
    "allowedLinks": [
      "google.com",
      "youtube.com",
      "https://www.google.com",
      "https://www.youtube.com"
    ],
    "beta": {
      "enabled": false,
      "censored": true,
      "autoPunishments": true
    }
  },
  "messages": {
    "filter": [
      "[prefix] Non vuoi essere il re dei cafoni? Controlla bene quello che scrivi. Le tue parole potrebbero scatenare una guerra mondiale.",
      "[prefix] Un buon trucco per capire se il tuo messaggio è offensivo è immaginare di riceverlo tu stesso. Ti farebbe ridere o arrabbiare?",
      "[prefix] Se hai dei dubbi sul tono del tuo messaggio, chiedi a un amico di fiducia di leggerlo prima d'inviarlo. Se anche lui si mette le mani nei capelli, forse è meglio che lo cancelli.",
      "[prefix] Prima d'inviare, pensa: \"Questo messaggio farà arrabbiare qualcuno?\" Se sì, cancellalo e scrivi più dolce.",
      "[prefix] Prima d'inviare, ricordati di controllare se hai offeso qualcuno. Non vorrai mica finire nei guai per una battuta!",
      "[prefix] Se vuoi evitare di offendere qualcuno con il tuo messaggio, fai una pausa e rileggilo. Magari scopri che non era una buona idea scrivere che la sua torta era immangiabile.",
      "[prefix] Prima di premere invio, ricorda che il destinatario potrebbe non apprezzare il tuo umorismo nero. O forse sì, ma non vuoi rischiare di scoprirlo.",
      "[prefix] Ricorda che la chat non è un ring di boxe. Non usare parole che potrebbero ferire gli altri. Se vuoi sfogarti, vai a correre o scrivi un diario.",
      "[prefix] Prima di premere invio, fai un respiro profondo e chiediti: \"Questo messaggio potrebbe far piangere qualcuno?\" Se la risposta è sì, cancellalo subito!",
      "[prefix] Non scrivere in chat ciò che non diresti a voce. Leggi il tuo messaggio ad alta voce. Se ti vergogni o ti penti, cambialo.",
      "[prefix] Dietro ogni schermo c'è una persona. Mettiti nei suoi panni e immagina la sua reazione. Se pensi che si ferisca o si deluda, riscrivilo."
    ],
    "spam": [
      "[prefix] WOW, rallenta un attimo!",
      "[prefix] Se continui a spammare così, la tua tastiera si scioglierà!",
      "[prefix] Sai che ogni messaggio che invii consuma un po' di ossigeno? Pensa al pianeta!",
      "[prefix] Mi piace leggere i tuoi messaggi, ma non tutti in una volta. Dammene uno al giorno, come una vitamina.",
      "[prefix] Non c'è bisogno di ripeterti, ti ho capito al primo messaggio. Anzi, al primo carattere.",
      "[prefix] Ti prego, smetti di spammare. Mi stai facendo venire il mal di testa. E anche il mal di schiena. E anche il mal di denti.",
      "[prefix] Spammare nella chat è come mangiare troppa pizza: ti fa venire il mal di pancia e poi ti penti. Sii più moderato!",
      "[prefix] Se continui a spammare nella chat, ti mando un virus che ti fa esplodere il computer. Scherzo, ma per favore smettila!",
      "[prefix] Spammare nella chat è una cosa da bambini. Se vuoi essere preso sul serio, devi imparare a comunicare in modo educato e intelligente. O almeno provarci!",
      "[prefix] Spammare nella chat è inutile. Nessuno legge i tuoi messaggi ripetitivi e noiosi. Se vuoi attirare l'attenzione, devi essere originale e creativo!",
      "[prefix] Spammare nella chat è una mancanza di rispetto verso gli altri utenti. Non ti piacerebbe se qualcuno ti interrompesse ogni volta che parli. Quindi perché lo fai tu?"
    ],
    "link": [
      "[prefix] Non ci interessa il tuo link. Preferiamo parlare di cose più importanti, come il tempo, il calcio o il nuovo album di Tiziano Ferro.",
      "[prefix] Postare dei link in chat è come lanciare delle monetine in una fontana. Spererai che si avverino i tuoi desideri, ma in realtà stai solo sprecando tempo e risorse.",
      "[prefix] Se vuoi condividere un link con noi, assicurati che sia sicuro e interessante. Altrimenti, rischi di ricevere una valanga di emoji arrabbiate.",
      "[prefix] Prima di postare un link, chiediti: \"È davvero necessario?\". Se la risposta è no, allora non farlo. Se la risposta è sì, allora probabilmente stai mentendo a te stesso.",
      "[prefix] Ricorda che i link sono come le caramelle: vanno bene ogni tanto, ma se ne abusi ti rovinano i denti. E anche la reputazione.",
      "[prefix] Non postare link a meno che non siano assolutamente indispensabili per la conversazione. E no, non lo sono mai. Nemmeno quelli dei gattini.",
      "[prefix] Se vuoi condividere qualcosa d'interessante con gli altri, usa le tue parole. I link sono pigri, impersonali e noiosi. E spesso pericolosi."
    ],
    "commands": [
      "[prefix] Non spammare comandi che potrebbero danneggiare il server, altrimenti ti ritroverai con un ban e un sacco di nemici.",
      "[prefix] Se non vuoi fare nulla, va bene, ma non rompere le scatole agli altri utenti con i tuoi tentativi di sabotaggio. Non sei un hacker, sei solo un troll.",
      "[prefix] Evita di spammare comandi inutili o pericolosi, perché non solo rischi di rovinare l'esperienza di tutti, ma anche di far arrabbiare gli admin. E credimi, non vuoi farli arrabbiare.",
      "[prefix] Se ti piace spammare comandi pericolosi, forse dovresti chiederti perché lo fai. Forse hai bisogno di più attenzione o di più amici. O forse sei solo un po' scemo.",
      "[prefix] Ricorda che il server è un luogo di divertimento e di condivisione, non di distruzione e di caos. Se vuoi fare il troll, vai altrove.",
      "[prefix] Se non vuoi fare nulla, va bene, ma non rompere le scatole agli altri con i tuoi comandi inutili. Non sei mica il capo del server."
    ]
  }
}